//1. Составьте программу, которая присваивает переменной d значение 7, а затем выводит на экран: в первой строке - это значение, во второй – квадрат этого значения, в третьей – куб этого значения.
let d = 7;
console.log(d);
console.log(d**2);
console.log(d**3);

///////////////////

//2. Составьте программу, которая принимает с клавиатуры целое число и, если оно положительное, увеличивает его вдвое.
//Программа должна выводить на экран новое значение.
let num = Number(prompt ("Inter number"));
if (num > 0) {
    console.log(num**2);
}

//////////////////////////////////////

//3. Составьте программу, которая принимает с //клавиатуры два целых числа и, если первое //больше второго, выводит на экран их сумму, если //же наоборот – выводит на экран их произведение. //В случае же, если числа одинаковы, программа //выводит на экран сообщение "числа одинаковые".
let numOne = Number(prompt ("Inter number one"));
let numTwo = Number(prompt ("Inter number two"));
if (numOne > numTwo) {
    console.log(numOne + numTwo);
} 
if (numOne < numTwo) {
    console.log(numOne * numTwo);
}
else {
    console.log("числа одинаковые");
}

///////////////////////////////////

//4. Составьте программу, которая принимает с //клавиатуры целое число и выводит на экран его //квадрат – но только в том случае, если //введенное число отрицательно.
//В противном случае – на экран выводится //сообщение "ошибка".
let numThree = Number(prompt ("Inter your number"));
if (numThree < 0){
        console.log((numThree**2)*-1);  
}
else{
    console.log("ERROR");
}

/////////////////////////////////

//5. Составьте программу, которая принимает с //клавиатуры два числа: первое – количество //учеников в классе, второе – количество стульев //в кабинете.
//Программа проверит соответствие между этими //двумя значениями и выведет на экран //соответствующую информацию.
//ввод: 24, 28 ⇒ вывод: стульев хватает; ввод: //24, 22 ⇒ вывод: стульев не хватает)
let quantityOfStudents = Number(prompt("Inter the quantity of students"));
let quantityOfchairs = Number(prompt("Inter the quantity of chairs"));
if (quantityOfStudents >= quantityOfchairs){
    console.log(quantityOfStudents + "," + quantityOfchairs + " ⇒ вывод: стульев хватает");
}
else{
    console.log(quantityOfStudents + "," + quantityOfchairs + " ⇒ вывод: стульев  не хватает");  
}

///////////////////////////////////

//6. Составьте программу, которая выводит на //экран все однозначные положительные числа в //возрастающем порядке.
//Перед началом вывода на экран следует вывести //"старт", а после окончания вывода чисел – //"финиш".
//вывод: старт, 1, ... 9, финиш)
let numbersOne = [1,2,3,4,5,6,7,8,9];
console.log('Start, ' + numbersOne + ' Finish');
    
///////////////////////////////////

//7. Составьте программу, которая выводит на //экран все двузначные положительные числа, //делящиеся без остатка на 5 (начиная с //наименьшего).
let numbersTwo = [];
for( let i = 10; i <= 99; i += 5){
    numbersTwo.push([i]);
    }
    console.log(numbersTwo);

    //тут я не понял почему мне консоль выдала такой ответ странный

    /////////////////////////////////////
    
//8. Написать цикл, который выводит те числа из //массива, которые больше или равны 15.
let numbersThree = [];
for( let i = 15; i <= 99; i++){
    numbersThree.push([i]);
    }
    console.log(numbersThree);
//9. Написать цикл, который выводит только //нечетные числа
//10. Вывести только те значения массива, индекс //которых кратен трем
